Repository: ghaidaak98/Greengamings
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Green Gamings
ar: جرين جامينز

source: Guess The Habitat
ar: خمن المواطن

source: LEVEL ONE - match the Animals
ar: المستوى الأول - طابق الحيوانات

source: start the game
ar: ابدأ اللعبة

source: Move(s)
ar: الخطوات

source: go to level two ?
ar: انتقل إلى المستوى الثاني؟

source: Hello my fellow travelers! Are you ready for our adventure ride? We'll start this level by matching the animal to its identical friend to discover more about those fascinating creatures!
ar: أهلًا أصدقائي المغامرين! مستعدين لرحلتنا الشيقة ؟ حنبدأ هذا المستوى عن طريق مطابقة الحيوانات مع صديقه التوأم عشان نكتشف أكثر عن هذه المخلوقات المبهرة!

source: mins
ar: دقايق

source: secs
ar: ثواني

source: restart
ar: إعادة

source: Did you know that camels can live up to 6 months without food or water? Because of the fat that's stored inside their humps. That's why they're called The Ship of the Desert!
ar: تعرفوا ان الجمل يعيش ٦ شهور بدون طعام أو ماء؟ عن طريق الدهون المخزنة في السنام. عشان كدة يسموه سفينة الصحراء!

source: Arabian Camels are herbivores, which means that they only feed on plants.
ar: لجمل العربي حيوان جدًّا صحي! أكلهم المفضل هو النباتات!

source: Arabian Camels are very social and like to greet each other by blowing in each other's faces.
ar: الجمل العربي حيوان جدًّا إجتماعي! عشان كدة دائمًا يعيشوا في مجموعات.

source: Arabian Camels have a third, clear eyelid that protects their eyes from blowing sand.
ar: الجمل عنده جفن ثالث شفاف! عشان يحمي عينه من التراب.

source: Camels can eat thorny bushes because of their thick lips.
ar: اتخيلوا ان الجمل عنده شفايف سميكة! عشان يقدر ياكل النباتات الشائكة الحادة.

source: This animal is called an Andean flamingo and it’s the rarest type of flamingos.
ar: ينادوا على هذا الحيوان باسم طائر الفلامنجو الأنديز وهو أندر أنواع طيور الفلامنجو!

source: Flamingo's long legs help them not to drown, walk long distances on water, and also to fly!
ar: رجل الفلامنجو الطويلة تساعدها انها ما تغرق، تمشي مسافات كبيرة على الماء، و كمان تطير!

source: Did you know that the Andean flamingo's pink color comes from eating their favorite food? Which is a type of shrimp!
ar: تعرفوا انه لون الفلامنجو زهري بسبب اكلها المفضل؟ الي هوا الجمبري!

source: Flamingos stand on 1 leg to conserve body heat.
ar: الفلامنجو توقف على رجل وحدة مو عشان تتباهى بتوازنها، عشان تحافظ على حرارة جسمها!

source: When Flamingos get married, they become partners for life!
ar: لمن الفلامنجو يتزوج، يفضلوا الأزواج مع بعض طول العمر!

source: If you focus hard enough, you can see that its feather pattern looks like a tuxedo! This type of penguin is called an Emperor penguin.
ar: لو ركزتوا، حتلاقوا انه لون شعر الحيوان يبين كانه لابس بدلة! اسم الحيوان هو البطريق الإمبراطوري و هو نوع من أنواع البطاريق.

source: When one Emperor Penguin marries another, they come up with their unique sound, so that if one gets lost, they can find each other! and they teach that sound to their babies too!
ar: لما يتزوج البطريق بزوجته يخترعوا صوت مميز لهم عشان ما يضيعوا من بعض!

source: Emperor Penguins live in polar deserts, specifically in Antarctica.
ar: البطريق الإمبراطوري يحب الجو البارد! عشان كدة يعيشوا في الصحراء المتجمدة و بيتهم اسمه أنتاركتيكا.

source: A penguin’s main food consists of fish, krill, squid, and crustaceans.
ar: أكل البطريق المفضل هو السمك، الجمبري، الحبار، و الاستاكوزا. يمي!

source: Emperor Penguins are the largest type of penguins! and yes there are other types of penguins.
ar: البطريق الإمبراطوري هو أكبر نوع من أنواع البطاريق!

source: We've all seen this beautiful bird in cartoons, right? It's called a Mute Swan.
ar: كلنا شفنا هذا الطائر الجميل في افلام الكرتون صح؟ اسمه البجع الأبكم.

source: Its called mute because its the least type of swan to make noise.
ar: سموه البجع الأبكم لانه اكثر نوع هادئ!

source: These swans look elegant, right? But don't even think about getting close to their babies, or all of that calmness might turn into anger!
ar: شكل البجع أنيق و لطيف صح؟ لكن لو فكرتوا انكم تمسكوا أطفالهم، كل اللطافة حتقلب لشر!

source: Don't be fooled by looks because this animal is actually harmless! It's called Manta Ray.
ar: نعرف انو الاسم ممكن يخوف، بس ترا الحيوان هذا جدًّا مسالم! اسمه شيطان البحر.

source: Manta Ray's are known for their curiosity and will swim with divers!
ar: معروف شيطان البحر بحس الفضول لدرجة انه يحب يسبح مع الغواصين!

source: Manta Rays have to keep on swimming to stay alive!
ar: شيطان البحر لازم ما يوقف سباحة عشان لا يموت!

source: Although Manta Rays are huge, their food is super tiny.
ar: تعرفوا ان شيطان البحر من أضخم الحيوانات البحرية!

source: This animal looks scary with its big horns, right? It's actually very friendly with humans! Its called a Domestic Yak, or just Yak for short.
ar: شكل الحيوان يخوف مع قرونه الكبيرة صح؟ طيب تعرفوا انه هذا الحيوان جدًّا لطيف مع البشر! اسمه الياك.

source: They are herbivores, meaning they don't eat meat. Very healthy, right?
ar: الياك حيوان ما ياكل اللحم أبدًا يحب يتغذى على الأعشاب فقط! جدًّا صحي صح؟

source: Some yaks live in the wild, but most of them live with humans.
ar: بعض الياك يعيشوا في البرية، لكن أغلبهم يعيشوا مع البشر لأننا أصحابهم!

source: Yaks survive the mountains cold weather by having thick, long hair that gives them heat!
ar: يقدر الياك يتعايش مع برودة الجبال بسبب شعره السميك و الطويل الي يعطيه دفء!

source: Yaks have HUGE lungs! It's so that they can breathe better with the low oxygen levels in the mountains.
ar: حيوان الياك عنده رئة كبيرة! عشان يقدروا يعيشوا في الجبال العالية لأن نسبة الأكسجين في الجبال جدًّا قليلة!

source: The African Elephant is the world's largest land mammal!
ar: تعالوا نتعرف على أكبر الثدييات البرية في العالم! الفيل الأفريقي.

source: Elephants use their huge ears as fans to cool themselves. How cool is that?
ar: انتوا متخيلين ان الفيل يستخدم اذنه الكبيره زي المروحة للتبريد عن نفسه!

source: Did you know that elephants eat so much that they spend up to three-quarters of their day eating?
ar: الفيل يقضي تقريبًا ثلاث أرباع يومه وهو ياكل!

source: Do you know the saying that goes like elephants never forget? It’s true! Their memory is so strong!
ar: تعرفوا ان الفيل ذاكرته جدًا قوية! لأن الجزء المسؤول عن الذاكرة في عقله حجمه كبير.

source: Did you know that Elephants communicate through vibrations from the ground?
ar: اتخيلوا ان الفيلة ما تتكلم مع بعض! يحبوا يتواصلوا عن طريق الذبذات في الأرض!

source: Congratulation!
ar: مبروك!

source: now you can move to level two for more challanges or you can stay here and enjoy more with the animals
ar: الان تقدر تنطلق وتكمل الجزء الثاني من اللعبة، او تبقى هنا وتلعب مرره ثانيه مع الحيوانات

source: Stay in level one
ar: ابقى في المستوى الاول

source: Arabian Camel
ar: الجمل العربي

source: Andean Flamingo
ar: الفلامنجو الأنديزي

source: Emperor Penguin
ar: البطريق الإمبراطوري

source: Mute Swan
ar: البجع الأبكم الهادي

source: Manta Ray
ar: شيطان البحر

source: Giant Panda
ar: الباندا الضخمة

source: Domestic Yak
ar: الياك

source: African Elephant
ar: الفيل الأفريقي

source: Level one
ar: المستوى الأول

source: LEVEL THREE - match the Animals with their Habitats
ar: المستوى الثالث - طابق الحيوانات مع مواطنها

source: go back to games?
ar: رجوع لصفحة الالعاب

source: Wasn't that fun! Didn't I tell you that was an excellent job, my friend? Since you learned about the animals and the habitats, let's see if you can identify the animal with their natural habitat.
ar: ما انبسطت! ما قلتلك انك فنان! بما انك تعلمت عن الحيوانات و المواطن ، خلينا نشوف إذا تقدر توصل الحيوان بموطنه الطبيعي!

source: Camels in Deserts
ar: الجمال في الصحراء

source: Camels can be found in both the Subtropical desert and the cold-winter desert. Camels can survive the desert with no water through their humps where stored fat can be turned to liquid.
ar: تعيش الجمال في الصحاري الحارة و الصحاري الباردة شتاءً. تعيش الجمال في الصحراء بدون ماء لأنه عندها سنام يحتوي على دهون و تتحول لسوائل.

source: Pandas in Forests
ar: الباندا في الغابات

source: Elephants in Grasslands
ar: الفيلة في المراعي

source: The African Elephant can inhibit all types of grasslands, rainforests, and subtropical deserts. Roots, grasses, fruit, and bark is what they feed on all day long.
ar: الفيل الأفريقي يقدر يعيش في كل أنواع المراعي، الغابات الإستوائية، و الصحاري الحارة. الجذور، الزرع، الفواكه، و لحاء الشجر هو أكلهم المفضل.

source: Yaks in Mountains
ar: الياك في الجبال

source: Domestic Yaks can survive the mountains cold weather because of their thick hair. Also, their large lungs can save them from low oxygen levels in mountains!
ar: الياك يقدر يستحمل العيش في الجبال لانه عنده شعر كثيف يقدر يعطيه دفء في الجو البارد. كمان رئته جدًا كبيرة فتساعده يتنفس لأن نسبة الأكسجين جدًّا قليلة في الجبال!

source: Penguins in Polar regions
ar: البطريق في المناطق القطبية

source: Emperor penguins live in polar deserts, specifically in Antarctica. Their thick skin and fat keeps them warm in the cold weather. They also gather their friends to stay warm.
ar: يعيش البطريق الإمبراطوري في الصحراء الجليدية، تحديدًا في أنتاركتيكا. جلدهم السميك و الدهون بتعطيهم دفء في الجو البارد. و كمان يتجمعوا الأصحاب جنب بعض عشان يدّفوا.

source: Swans in Wet lands
ar: البجع الأبكم في الأراضي الرطبة

source: Swans can be found in most types of wetlands such as ponds, slow rivers, and lakes. They need to live on wetlands because all their food lives there too! they eat frogs, snails, and fish.
ar: البجع يعيش في أغلب المياه الرطبة زي البرك، الأنهار البطيئة، والبحيرات. لازم يعيشوا هناك لأنو أكلهم كمان يعيش هناك! يحبوا ياكل الضفادع، الحلزون، و السمك.

source: Flamingos in Islands
ar: الفلامينجو في الجزر

source: Andean flamingos are one of the 6 types of flamingos and they live in shallow coastal lagoons of islands.
ar: الفلامنجو الأندي هو واحد من ٦ أنواع من الفلامنجو و يعيشوا في بحيرات الجزر الساحلية.

source: Manta Rays in the Ocean
ar: شيطان البحر في المحيطات

source: Manta Rays are found all over the world is oceans, specifically in cool water.
ar: شيطان البحر موجود في كل المحيطات، تحديدًا في المياه الباردة.

source: Level three
ar: المستوى الثالث

source: LEVEL TWO - match the Habitats
ar: المستوى الثاني - طابق المواطن

source: go to level three ?
ar: انتقل إلى المستوى الثالث؟

source: Deserts
ar: الصحاري

source: I know the first thing that came to your mind was a boring dry place, right? Well, let me explain what a desert is. A desert is any large area with little to no rain.
ar: أول شيء جا في بالكم مكان حار و يطفش صح؟ الصحراء هي اي مكان واسع نادرًا تمطر فيه.

source: Some desserts are freezing cold! they are called the polar deserts.
ar: مو كل الصحاري حارة! بعض الصحاري تكون جدًّا باردة و اسمها الصحاري الجليديبة.

source: The largest hot desert is the Sahara and the larget coldest one is Antarctica!
ar: أكبر صحراء حارة هي الصحراء الكبرى و أكبر صحراء جليدية هي القطب الجنوبي!

source: Camels live in hot deserts and polar bears live in cold deserts.
ar: الجمال تعيش في الصحراء الحارة، أما الدب القطبي يعيش في الصحراء الجليدية.

source: Forests
ar: الغابات

source: Have you ever been camping? Do you know where people usually camp? In forests of course!
ar: عمركم خيَّمتوا؟ طيب تعرفوا فين الناس عادة يخيِّموا؟ في الغابات طبعًا!

source: The largest forest on our planet is the Amazon Rainforest.
ar: أكبر غابة على كوكبنا هي غابة الأمازون!

source: Forests are very important because they are made up of trees and trees give us oxygen to breathe.
ar: الغابات جدًّا مهمة لأن فيها شجر و الشجر هو الي يعطينا أوكسجين عشان نتنفس!

source: Pandas live in bamboo forests while gorillas live in rain forests.
ar: غابات الخيزران مثلًا تعيش فيها الباندا، و الغابات الإستوائية تعيش فيها الغوريلا.

source: Grasslands
ar: المراعي

source: This is a cows favorite place! and it is called a grassland, which is any large area filled with grass and short plants.
ar: هذا المكان المفضل للفيلة! اسمه المراعي و هو اي مكان واسع مليان زرع و نباتات القصيرة.

source: Grasslands are perfect for growing wheat and corn. Yummy!
ar: المراعي مكان مثالي لزرع القمح و الذرة. يمي!

source: Mountains
ar: الجبال

source: Have you ever heard of Mount Everest? Its the tallest mountain on Earth!
ar: سمعتوا بجبل افريست؟ هذا أطول جبل على كوكب الأرض!

source: A mountain is a part of the ground that rises above everything else.
ar: لما يكون في أرض جدًّا مرتفعة عن باقي الأراضي، نسميها جبل.

source: The higher you will climb, the harder it is to breathe! because oxygen levels are low in mountains.
ar: كل ما اتسلقتوا أعلى، كل ما صار أصعب انه تتنفسوا! لأنه نسبة الأكسجين قليلة في الجبال.

source: Some of the animals that live in mountains are yaks and brown bears.
ar: بعض الحيوانات الي تعيش في الجبال هي الياك و الدب البني.

source: Polar regions
ar: المناطق القطبية

source: Polar regions are the coldest regions of our planet!
ar: المناطق القطبية هي أبرد المناطق في كوكبنا!

source: Planet Earth has 2 polars: Antarctican and the Arctic.
ar: كوكب الأرض عنده منطقتين قطبية: الشمالية و الجنوبية.

source: Penguins and some orcas live in polar regions.
ar: البطاريق و بعض أنواع الحوت القاتل يعيشوا في المناطق القطبية.

source: Wet lands
ar: الأراضي الرطبة

source: This Magical habitat we always see in movies is called a wetland.
ar: هذا الموطن السحري الي شفناه في أفلام كثيرة اسمه الأراضي الرطبة!

source: Wetlands are lands where the ground is covered with shallow water.
ar: لأراضي الرطبة هي أراضي مغطاه بمياه غير عميقة.

source: Some of the animals that live in wetlands are frogs and swans.
ar: الضفادع و البجع هي بعض الحيوانات الي تعيش في الأراضي الرطبة!

source: There is a The World Wetland Day! It is on 2nd of February.
ar: في يوم عالمي للأراضي الرطبة! بتاريخ ٢ فبراير.

source: Island
ar: الجزر

source: An island is a large land that is not connected to any other land and is surrounded by water from all sides.
ar: اتخيلوا أرض غير مرتبطة بأي أرض تانية و حولها ماء من كل الجهات. هذه هي الجزيرة.

source: The biggest island on our planet is Greenland and the smallest island is Bishop Rock.
ar: أكبر جزيرة على كوكب الأرض هي قرينلاند، و أصغر جزيرة هي بيشوب روك!

source: Some of the animals that live on islands are flamingos and iguanas.
ar: بعض الحيوانات الي تعيش في الجزر هي الفلامنجو و الإيغوانا!

source: Ocean
ar: المحيطات

source: 71%% of Earth is covered with water and this water is called the ocean.
ar: تعرفوا ان كوكبنا يغطيه الماء بنسبة ٧١٪ ! يعني أكثر من النص! اسم هذه المياه هو المحيطات.

source: Did you know that the oceans of our planet are so deep that only 5%% of them have been discovered?
ar: تعرفوا انه محيطات كوكبنا عميقة جدًّا لدرجة بس ٥٪ من المحيط اكتشفوه؟

source: The largest ocean is called the pacific ocean.
ar: أكبر محيط على كوكب الأرض هو المحيط الهادي.

source: Manta Rays and octuposes live in the ocean.
ar: شيطان البحر و الأخطبوط هي من حيوانات الي تعيش في المحيطات.

source: Level two
ar: المستوى الثاني

source: Wow that was fast! Now match the identical habitats together.
ar: واو ما شاء الله خلصنا بسرعة! الآن حنوصل المواطن المتشابهة مع بعض.!

source: our games
ar: شوف العابنا

source: age
ar: العمر

source: Guess the Habitat!
ar: خمن المواطن

source: Let's discover more about animals and their habitats! Match the cards and fun facts will pop up! Do you think you'll make it to the final level and win?
ar: يلا نكتشف أكثر عن الحيوانات و المواطن! طابق الكروت و حتطلعلك حقائق ما كنت تعرفها! تتوقع حتوصل للمستوى الأخير عشان تفوز؟

source: Play
ar: العب

source: Home
ar: الرئيسية

source: Games
ar: الألعاب

source: Team
ar: الفريق

source: Shortcuts
ar: اختصارات

source: Guess the Habitat
ar: خمن المواطن

source: Other sites
ar: مواقع أخرى

source: Global Shapers
ar: جلوبل شيبرز

source: Jeddah Hub
ar: مركز جدة

source: Al-Khobar Hub
ar: مركز الخبر

source: Riyadh Hub
ar: مركز الرياض

source: Follow us
ar: تابعنا

source: Green Gaming is a fun educational online-gaming platform based on our spectacular planet. It focuses on spreading awareness about environmental issues to prepare our future heroes for their rescue mission 💪.
ar: جرين جايمنق هي منصة إلكترونية تثقيفية مليئة بالالعاب الممتعة عن كوكبنا الخلاب و تنشر الوعي عن مشاكله البيئية لتجهيز أبطال المستقبل في مهمة إنقاذه 💪

source: initiative of Global Shapers
ar: مبادرة من الجلوبل شيبرز

source: see our games
ar: شوف العابنا

source: Mission
ar: مهمتنا

source: Our Goal is
ar: هدفنا هو

source: To raise a generation of super heroes that will protect our fascinating green planet and help in saving it! 🦸🦸‍♂️.
ar: هدفنا هو انه نطلِّع جيل من الأبطال الخارقين يدافعوا عن كوكبنا الأخضر المدهش و يساعدوا في المحافظة عليه!

source: AWARENESS
ar: وعي

source: FUN
ar: مرح

source: EDUCATIONAL
ar: تعليم

source: we launched a new
ar: اطلقنا

source: game!!!
ar: لعبة جديدة

source: Team members
ar: اعضاء الفريق

source: I am Ghaidaa Khan, a computer science student, but that’s not everything about me. I am self defined explorer and I love to learn a new thing everyday if it's possible, Just like you!
ar: انا غيداء خان، طالبة علوم حاسبات لكن دا مو كل شيء عني. انا دايما اعرف نفسي اني مستكشفة و محبة للتعلم، زيكم انتوا!

source: Bashayer
ar: بشاير

source: Greeting fellow humans! Bashayer is here. A barista by morning, Advertisment student by noon and a fairy by night ;) i make magic happen.
ar: السلام عليكم أيها البشر! بشائر بنتن هنا محضرة قهوة في الصباح, طالبة إعلان في الضهر, أخت تنة و رنة في الليل ؛)

source: Rodeen
ar: رودين

source: Hello everyone! My names Rodeen and i don't like writing about myself. I love watching Disney movies and cartoons all day. oh, and i'm a college student too.
ar: أهلًا! اسمي رودين و ما أحب أكتب عن نفسي بس أحب أتفرج أفلام ديزني و كرتون طول اليوم. اوه صح، و أنا طالبة جامعة كمان.

source: Monier
ar: منير

source: My name is Monier Daghistani, I’m an architecture student. I have a lot of interest in the animal world and in the environment. I believe that we can help make the world a better place one small step at a time.
ar: اسمي منير داغستاني ، أنا طالب هندسة معمارية ، لدي اهتمام كبير بالحيوانات ومساعدة البيئة ، أعتقد حقًا أنه يمكننا تغيير عقول الناس وجعل العالم مكانًا أفضل.

source: Mohammed
ar: محمد

source: Turki
ar: تركي

source: hi, my name is Turki, I am a self-taught programmer, tech entrepreneur, feminist, minimalist, and vegan. I love to work every day while listening to electrical music, and I love to dance too.
ar: اهلا، انا اسمي تركي، انا مبرمج تعلمت البرمجة بنفسي، انا رائد اعمال تقني، بسيط وإيضا نباتي. احب دائما اشتغل وانا اتسمع للموسيقى، وبرضو احب ارقص.

source: Renad Alorri
ar: ريناد العري
